## Plan Result (sandbox - TerraformPlanApply)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this[&#34;darts&#34;]
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this[&#34;juror&#34;]
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this[&#34;juror-public&#34;]
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_zone.zone[0]
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;dynatrace-activegate-vnet-nonprod&#34;]
  * module.sandbox-apps-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-nonprodi&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this["darts"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this["juror"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_cname_record.this["juror-public"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "sandbox.apps.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + soa_record (known after apply)
    }

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["dynatrace-activegate-vnet-nonprod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "dynatrace-activegate-vnet-nonprod"
      + private_dns_zone_name = "sandbox.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Network/virtualNetworks/dynatrace-activegate-vnet-nonprod"
    }

  # module.sandbox-apps-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-nonprodi"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-nonprodi"
      + private_dns_zone_name = "sandbox.apps.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/private-dns-resolver-uksouth-nonprodi/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-nonprodi"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":843,"Program":"tfcmt","SHA1":"","Target":"sandbox - TerraformPlanApply","Vars":{}} -->